IDEA StatiCa Open Model
ReinfFabric.DistanceX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Distance between bars - direction X
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double DistanceX { get; set; }
Public Property DistanceX As Double
	Get
	Set
public:
property double DistanceX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinfFabric Class
IdeaRS.OpenModel.Detail Namespace